app/controllers/batch_transfers_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT `students`.* FROM `students` WHERE (`students`.batch_id = 1)
---
  def graduation
    @batch = Batch.find params[:id], :include => [:students]

SELECT * FROM `batches` WHERE (`batches`.`id` = 3)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`is_deleted` = 0) AND (`elective_groups`.batch_id = 3)
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 3)
---
  def subject_transfer
    @batch = Batch.find(params[:id])
    @elective_groups = @batch.elective_groups.all(:conditions => {:is_deleted => false})
    @normal_subjects = @batch.normal_batch_subject
    @elective_subjects = Subject.find_all_by_batch_id(@batch.id,:conditions=>["elective_group_id IS NOT NULL AND is_deleted = false"])

SELECT * FROM `batches` WHERE (`batches`.`is_deleted` = 0 AND `batches`.`is_active` = 1) AND (`batches`.`course_id` = '1')
---
  def update_batch
    @batches = Batch.find_all_by_course_id(params[:course_name], :conditions => { :is_deleted => false, :is_active => true })

SELECT * FROM `batches` WHERE (`batches`.`id` = 3)
---
  def new_subject
    @subject = Subject.new
    @batch = Batch.find params[:id] if request.xhr? and params[:id]