app/controllers/courses_controller.rb

  def update_batch
    @batch = Batch.find_all_by_course_id(params[:course_name], :conditions => { :is_deleted => false, :is_active => true })
---
SELECT * FROM `batches` WHERE (`batches`.`is_deleted` = 0 AND `batches`.`is_active` = 1) AND (`batches`.`course_id` = 'test')

  def create
    @course = Course.new params[:course]
    if @course.save
---
INSERT INTO `courses` (`created_at`, `code`, `updated_at`, `course_name`, `is_deleted`, `section_name`, `grading_type`) VALUES('2016-02-20 20:47:03', '6A', '2016-02-20 20:47:03', 'Classe 6eme A', 0, '', '0')

  def find_course
    @course = Course.find params[:id]
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 3)