app/controllers/grading_levels_controller.rb

  def create
    @grading_level = GradingLevel.new(params[:grading_level])
    @batch = Batch.find params[:grading_level][:batch_id] unless params[:grading_level][:batch_id].empty?
    respond_to do |format|
      if @grading_level.save
---
INSERT INTO `grading_levels` (`name`, `created_at`, `updated_at`, `batch_id`, `order`, `is_deleted`, `min_score`, `description`, `credit_points`) VALUES('aaaa', '2016-02-21 23:13:15', '2016-02-21 23:13:15', NULL, NULL, 0, 10, 'test', 10.0)

  def edit
    @grading_level = GradingLevel.find params[:id]
---
SELECT * FROM `grading_levels` WHERE (`grading_levels`.`id` = 18) ORDER BY min_score desc

  def update
    @grading_level = GradingLevel.find params[:id]
    respond_to do |format|
      if @grading_level.update_attributes(params[:grading_level])
---
SELECT * FROM `grading_levels` WHERE (`grading_levels`.`id` = 14) ORDER BY min_score desc
UPDATE `grading_levels` SET `updated_at` = '2016-02-22 22:55:31', `name` = 'nn2' WHERE `id` = 14

  def destroy
    @grading_level = GradingLevel.find params[:id]
---
SELECT * FROM `grading_levels` WHERE (`grading_levels`.`id` = 8) ORDER BY min_score desc

  def show
    @batch = nil
    if params[:batch_id] == ''
      @grading_levels = GradingLevel.default
    else
      @grading_levels = GradingLevel.for_batch(params[:batch_id])
      @batch = Batch.find params[:batch_id] unless params[:batch_id] == ''
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)